In [1]:
import pandas as pd

df = pd.read_excel('coal_lignite.xlsx')
df.dropna(inplace=True)
df.head()

   TIME  Coking coal  Other bituminous coal      Coal   Lignite
0  1990      97971.8               167295.7  265267.5  143889.8
2  1991      88625.2               168372.6  256997.8  126283.5
4  1992      87733.1               162160.2  249893.3  115885.3
6  1993      82374.4               147381.8  229756.2  110751.9
8  1994      81478.3               150232.3  231710.6  103823.8

In [2]:
df.drop(['Coking coal', 'Other bituminous coal'], axis=1, inplace=True)
df.to_csv('coal.csv')

In [3]:
df

    TIME      Coal   Lignite
0   1990  265267.5  143889.8
2   1991  256997.8  126283.5
4   1992  249893.3  115885.3
6   1993  229756.2  110751.9
8   1994  231710.6  103823.8
10  1995  235472.9  100350.9
12  1996  235875.5   99859.2
14  1997  232218.3   96461.6
16  1998  222118.3   91139.8
18  1999  208123.1   88035.7
20  2000  204057.0   90854.0
22  2001  201487.2   93054.0
24  2002  198975.4   93269.4
26  2003  203657.1   94270.1
28  2004  203026.9   93342.9
30  2005  193455.8   90632.2
32  2006  199845.2   90626.0
34  2007  198307.3   91213.6
36  2008  184847.1   88840.8
38  2009  157730.1   85531.2
40  2010  169053.5   84130.2
42  2011  164718.9   88656.7
44  2012  169832.1   89875.3
46  2013  164378.4   85272.7
48  2014  156400.8   83188.5
50  2015  157145.6   82706.1
52  2016  153681.3   77466.7
54  2017  145813.5   78540.6
56  2018  137724.9   75943.6
58  2019  114776.8   63895.3